<script lang="ts" setup>
const route = useRoute()
const { data: post } = await useAsyncData(`post:${route.params.slug}`, () => queryContent(`/posts/${route.params.slug}`).findOne())

useSeoMeta({
  title: post.value?.title,
  description: post.value?.summary,
  ogTitle: post.value?.title,
  ogDescription: post.value?.summary,
  twitterTitle: post.value?.title,
  twitterDescription: post.value?.summary,
})

const {
  data: postDB,
  refresh,
} = await useAsyncData(`post:${route.params.slug}:db`, () => $fetch(`/api/posts/${route.params.slug}`, { method: 'POST' }), { lazy: true })

function getDetails() {
  const likes = postDB.value?.likes ?? 0
  const views = postDB.value?.views ?? 0

  return {
    likes: `${likes} 点赞`,
    views: `${views} 浏览`,
  }
}

const likeCookie = useCookie<boolean>(`post:like:${route.params.slug}`, {
  maxAge: 7200,
})

async function handleLike() {
  if (likeCookie.value)
    return
  await $fetch(`/api/posts/like/${route.params.slug}`, { method: 'PUT' })
  await refresh()
  likeCookie.value = true
}

const { copy, copied } = useClipboard({
  source: `https://hsinyau.com/posts/${route.params.slug}`,
  copiedDuring: 4000,
})

// 阅读进度
const progress = ref(0)
const { y: scrollY } = useWindowScroll()
const { height: windowHeight } = useWindowSize()

useEventListener(document, 'scroll', () => {
  const content = document.querySelector('.article-content')
  if (!content)
    return

  const scrollTop = scrollY.value - (content as HTMLElement).offsetTop
  const docHeight = content.scrollHeight

  // 确保进度在 0-100 之间
  progress.value = Math.min(100, Math.max(0, Math.round((scrollTop / (docHeight - windowHeight.value)) * 100)))
})
</script>

<template>
  <main>
    <ContentDoc :path="`/posts/${route.params.slug}`">
      <template #default="{ doc: post }">
        <div class="flex gap-8">
          <div class="flex-1">
            <div class="flex">
              <NuxtLink
                class="flex items-center gap-2 mb-8 group text-sm hover:text-black dark:hover:text-white duration-300"
                to="/posts"
              >
                <UIcon
                  class="group-hover:-translate-x-1 transform duration-300"
                  name="i-ph-arrow-left-duotone"
                  size="20"
                />
                返回上页
              </NuxtLink>
            </div>
            <div class="mt-2">
              <div class="flex items-end gap-4 flex-wrap">
                <h1 class="font-bold text-3xl text-black dark:text-white">
                  {{ post.title }}
                </h1>
              </div>
              <div class="border-l-2 pl-2 mt-2 border-gray-300 dark:border-gray-700 rounded-sm flex gap-1 items-center flex-wrap">
                <UIcon name="ph:tag-duotone" size="16" />
                <p class="text-sm">
                  {{ post.tag }}
                </p>·
                <UIcon name="ph:calendar-duotone" size="16" />
                <p class="text-sm">
                  {{ useDateFormat(post.created, 'YYYY-MM-DD') }}
                </p>·
                <UIcon name="i-ph-heart-duotone" size="16" />
                <p class="text-sm">
                  {{ getDetails().likes }}
                </p>·
                <UIcon name="i-ph-eye-duotone" size="16" />
                <p class="text-sm">
                  {{ getDetails().views }}
                </p>·
                <UIcon name="ph:cursor-text-duotone" size="16" />
                <p class="text-sm">
                  {{ post.readingTime.words }}字
                </p>·
                <UIcon name="ph:timer-duotone" size="16" />
                <p class="text-sm">
                  {{ Math.round(post.readingTime.words / 400) }}分钟阅读
                </p>
              </div>
              <div class="mt-4 text-base">
                AI 生成的摘要：{{ post.summary }}
              </div>
              <UDivider
                class="mt-8"
                icon="i-ph-pencil-line-duotone"
              />
              <div class="mt-8 flex gap-8">
                <article class="flex-1 article-content">
                  <ContentRenderer :value="post">
                    <ContentRendererMarkdown
                      :value="post"
                      class="!max-w-none prose dark:prose-invert"
                    />
                  </ContentRenderer>
                </article>
                <aside class="hidden lg:block w-52">
                  <div class="sticky top-8">
                    <PostToc :toc="post?.body?.toc?.links" />
                    <div class="flex items-center gap-2 text-sm mt-4 text-zinc-500">
                      阅读进度：{{ progress }}%
                    </div>
                  </div>
                </aside>
              </div>
              <UDivider
                class="my-16"
                icon="i-ph-hands-clapping-duotone"
              />
              <div class="space-y-8">
                <p>
                  <strong>感谢您阅读这篇文章！如果您喜欢它，请考虑与您的朋友分享。别忘了点个赞哦！</strong>
                </p>
                <div class="flex gap-4 items-center flex-wrap">
                  <UButton
                    :label="`${postDB?.likes} 点赞`"
                    :color="likeCookie ? 'red' : 'white'"
                    icon="i-ph-heart-duotone"
                    size="lg"
                    variant="solid"
                    @click.prevent="handleLike()"
                  />
                  <UButton
                    v-if="copied"
                    color="green"
                    icon="i-ph-copy-simple-duotone"
                    label="复制成功"
                    size="lg"
                    variant="outline"
                    @click.prevent="copy()"
                  />
                  <UButton
                    v-else
                    color="white"
                    icon="i-ph-copy-simple-duotone"
                    label="复制链接"
                    size="lg"
                    variant="solid"
                    @click.prevent="copy()"
                  />
                </div>
              </div>
              <UDivider
                class="my-16"
                icon="i-ph:messenger-logo-duotone"
              />
              <HsinComment />
            </div>
          </div>
        </div>
      </template>
      <template #not-found>
        <div class="flex justify-center items-center">
          <div class="flex justify-center items-center flex-col gap-4">
            <svg class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7114" width="200" height="200">
              <path d="M405.895006 621.284082a365.909333 141.312 17.86 1 0 86.678578-269.003996 365.909333 141.312 17.86 1 0-86.678578 269.003996Z" fill="#FFFFFF" p-id="7115" />
              <path d="M638.634667 668.672c-69.632 0-151.893333-14.336-234.837334-40.96-93.866667-30.378667-177.493333-72.704-235.861333-119.808-60.074667-48.469333-86.016-96.597333-73.386667-135.509333 25.6-79.189333 201.386667-90.794667 400.042667-26.624 93.866667 30.378667 177.493333 72.704 235.861333 119.808 60.074667 48.469333 86.016 96.597333 73.386667 135.509333-12.629333 38.912-61.781333 62.464-138.922667 66.901333-8.192 0.682667-17.408 0.682667-26.282666 0.682667zM260.096 318.464c-8.874667 0-17.408 0.341333-25.941333 0.682667-69.973333 4.096-116.053333 24.917333-126.634667 57.685333s14.677333 76.458667 69.290667 120.490667c57.002667 46.08 139.264 87.722667 231.424 117.418666s183.296 43.690667 256.341333 39.594667c69.973333-4.096 116.053333-24.917333 126.634667-57.685333 10.581333-32.426667-14.677333-76.458667-69.290667-120.490667-57.002667-46.08-139.264-87.722667-231.424-117.418667-81.578667-26.282667-162.474667-40.277333-230.4-40.277333z" fill="#BABABA" p-id="7116" />
              <path d="M847.530667 697.344l39.594666 39.594667c6.144 6.144 6.144 16.725333 0 22.869333-6.144 6.144-16.725333 6.144-22.869333 0L824.661333 720.213333c-6.144-6.144-6.144-16.725333 0-22.869333 6.485333-6.144 16.725333-6.144 22.869334 0z" fill="#F0F0F0" p-id="7117" />
              <path d="M875.861333 771.413333c-5.802667 0-11.946667-2.389333-16.384-6.826666l-39.594666-39.594667c-8.874667-8.874667-8.874667-23.552 0-32.426667 8.874667-8.874667 23.552-8.874667 32.426666 0l39.594667 39.594667c8.874667 8.874667 8.874667 23.552 0 32.426667-4.437333 4.778667-10.24 6.826667-16.042667 6.826666zM836.266667 699.392c-2.389333 0-4.778667 1.024-6.485334 2.730667-3.754667 3.754667-3.754667 9.557333 0 13.312l39.594667 39.594666c3.754667 3.754667 9.557333 3.754667 13.312 0s3.754667-9.557333 0-13.312L843.093333 702.122667c-2.048-1.706667-4.437333-2.730667-6.826666-2.730667z" fill="#BABABA" p-id="7118" />
              <path d="M868.693333 607.914667h55.978667c8.874667 0 16.384 7.168 16.384 16.384 0 8.874667-7.168 16.384-16.384 16.384h-55.978667c-8.874667 0-16.384-7.168-16.384-16.384 0.341333-8.874667 7.509333-16.384 16.384-16.384z" fill="#F0F0F0" p-id="7119" />
              <path d="M924.672 647.509333h-55.978667c-12.629333 0-23.210667-10.24-23.210666-23.210666s10.24-23.210667 23.210666-23.210667h55.978667c12.629333 0 23.210667 10.24 23.210667 23.210667s-10.24 23.210667-23.210667 23.210666z m-55.978667-32.768c-5.12 0-9.557333 4.096-9.557333 9.557334s4.096 9.557333 9.557333 9.557333h55.978667c5.12 0 9.557333-4.096 9.557333-9.557333s-4.096-9.557333-9.557333-9.557334h-55.978667z" fill="#BABABA" p-id="7120" />
              <path d="M767.658667 741.717333v55.978667c0 8.874667-7.168 16.384-16.384 16.384-8.874667 0-16.384-7.168-16.384-16.384v-55.978667c0-8.874667 7.168-16.384 16.384-16.384 9.216 0 16.384 7.509333 16.384 16.384z" fill="#F0F0F0" p-id="7121" />
              <path d="M751.616 820.565333c-12.629333 0-23.210667-10.24-23.210667-23.210666v-55.978667c0-12.629333 10.24-23.210667 23.210667-23.210667s23.210667 10.24 23.210667 23.210667v55.978667c-0.341333 12.970667-10.581333 23.210667-23.210667 23.210666z m0-88.405333c-5.12 0-9.557333 4.096-9.557333 9.557333v55.978667c0 5.12 4.096 9.557333 9.557333 9.557333s9.557333-4.096 9.557333-9.557333v-55.978667c-0.341333-5.12-4.437333-9.557333-9.557333-9.557333z" fill="#BABABA" p-id="7122" />
              <path d="M458.410667 501.418667m-215.722667 0a215.722667 215.722667 0 1 0 431.445333 0 215.722667 215.722667 0 1 0-431.445333 0Z" fill="#F0F0F0" p-id="7123" />
              <path d="M458.410667 724.309333c-122.88 0-222.549333-100.010667-222.549334-222.549333 0-122.88 100.010667-222.549333 222.549334-222.549333 122.88 0 222.549333 100.010667 222.549333 222.549333 0 122.538667-99.669333 222.549333-222.549333 222.549333z m0-431.786666c-115.370667 0-208.896 93.866667-208.896 208.896s93.866667 208.896 208.896 208.896 208.896-93.866667 208.896-208.896-93.525333-208.896-208.896-208.896z" fill="#BABABA" p-id="7124" />
              <path d="M638.634667 668.672c-69.632 0-151.893333-14.336-234.837334-40.96-93.866667-30.378667-177.493333-72.704-235.861333-119.808-60.074667-48.469333-86.016-96.597333-73.386667-135.509333 25.6-79.189333 201.386667-90.794667 400.042667-26.624 93.866667 30.378667 177.493333 72.704 235.861333 119.808 60.074667 48.469333 86.016 96.597333 73.386667 135.509333-12.629333 38.912-61.781333 62.464-138.922667 66.901333-8.192 0.682667-17.408 0.682667-26.282666 0.682667zM260.096 318.464c-8.874667 0-17.408 0.341333-25.941333 0.682667-69.973333 4.096-116.053333 24.917333-126.634667 57.685333s14.677333 76.458667 69.290667 120.490667c57.002667 46.08 139.264 87.722667 231.424 117.418666s183.296 43.690667 256.341333 39.594667c69.973333-4.096 116.053333-24.917333 126.634667-57.685333 10.581333-32.426667-14.677333-76.458667-69.290667-120.490667-57.002667-46.08-139.264-87.722667-231.424-117.418667-81.578667-26.282667-162.474667-40.277333-230.4-40.277333z" fill="#BABABA" p-id="7125" />
              <path d="M667.648 501.077333c0 115.712-103.082667-18.432-218.453333-18.432S249.173333 616.789333 249.173333 501.077333s93.525333-209.237333 209.237334-209.237333 209.237333 93.525333 209.237333 209.237333z" fill="#FFFFFF" p-id="7126" />
              <path d="M696.661333 359.424m-144.042666 0a144.042667 144.042667 0 1 0 288.085333 0 144.042667 144.042667 0 1 0-288.085333 0Z" fill="#FFFFFF" p-id="7127" />
              <path d="M696.661333 510.293333c-83.285333 0-150.869333-67.584-150.869333-150.869333S613.376 208.213333 696.661333 208.213333s150.869333 67.584 150.869334 150.869334-67.584 151.210667-150.869334 151.210666z m0-288.426666c-75.776 0-137.216 61.44-137.216 137.216 0 75.776 61.44 137.216 137.216 137.216 75.776 0 137.216-61.44 137.216-137.216 0-75.434667-61.44-137.216-137.216-137.216z" fill="#BABABA" p-id="7128" />
              <path d="M770.389333 324.949333c-12.288 7.168-24.576 14.336-37.205333 21.504-4.096 2.389333-4.437333 9.216 0 11.605334 12.288 6.826667 24.576 13.312 37.205333 20.138666 7.509333 4.096 14.336-7.509333 6.826667-11.605333-12.288-6.826667-24.576-13.312-37.205333-20.138667v11.605334c12.288-7.168 24.576-14.336 37.205333-21.504 7.509333-4.437333 0.682667-16.042667-6.826667-11.605334z" fill="#BABABA" p-id="7129" />
              <path d="M612.693333 336.554667c12.288 7.168 24.576 14.336 37.205334 21.504v-11.605334c-12.288 6.826667-24.576 13.312-37.205334 20.138667-7.850667 4.096-0.682667 16.042667 6.826667 11.605333 12.288-6.826667 24.576-13.312 37.205333-20.138666 4.437333-2.389333 4.437333-9.216 0-11.605334-12.288-7.168-24.576-14.336-37.205333-21.504-7.509333-4.778667-14.336 7.168-6.826667 11.605334z" fill="#BABABA" p-id="7130" />
              <path d="M697.002667 382.293333c-14.336 0-26.282667 11.605333-26.282667 26.282667 0 3.754667 3.072 6.485333 6.485333 6.485333 3.754667 0 6.485333-3.072 6.485334-6.485333 0-7.168 5.802667-12.970667 12.970666-12.970667 7.168 0 12.970667 5.802667 12.970667 12.970667 0 3.754667 3.072 6.485333 6.485333 6.485333s6.485333-3.072 6.485334-6.485333c0.682667-14.677333-10.922667-26.282667-25.6-26.282667z" fill="#BABABA" p-id="7131" />
              <path d="M622.592 461.824l44.373333 28.672-30.037333 21.504-29.696-3.754667z" fill="#FFFFFF" p-id="7132" />
              <path d="M673.109333 487.082667c0-3.754667-3.072-6.485333-6.485333-6.485334-2.048 0-4.096 1.024-5.12 2.730667-12.288 16.384-35.157333 23.552-49.834667 23.893333 16.384-18.432 9.557333-43.690667 7.850667-48.810666 0-0.341333 0-0.682667-0.341333-0.682667-1.024-2.389333-3.413333-3.754667-6.144-3.754667-3.754667 0-6.485333 3.072-6.485334 6.485334 0 0.682667 0 1.365333 0.341334 1.706666 0 0.341333 8.192 23.552-6.485334 37.888-3.413333 3.413333-4.437333 8.192-2.730666 12.629334 1.706667 4.437333 5.461333 7.168 10.24 7.509333h2.730666c16.042667 0 44.373333-7.509333 60.757334-28.330667 1.024-1.024 1.706667-2.730667 1.706666-4.778666z" fill="#BABABA" p-id="7133" />
            </svg>
            <p>这颗星球还没有知识哦，去其他地方探索吧</p>
          </div>
        </div>
      </template>
    </ContentDoc>
  </main>
</template>

<style>
.prose h2 a,
.prose h3 a,
.prose h4 a {
  @apply no-underline;
}
</style>
